DataProcessors/ЗавершениеРаботыБитыеСсылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗавершениеРаботыБитыеСсылки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗавершениеРаботыОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗавершениеРаботыОрганизации</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Document.ЗагрузкаДанныхДолжника</xr:Item>
				<xr:Item>Document.ЗагрузкаДанных</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоКатегориям</xr:Item>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
				<xr:Item>AccumulationRegister.ИсковыеТребования</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗавершениеРаботыБитыеСсылки/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗавершитьРаботу(Команда) 
	ЗавершитьРаботуСервер();
КонецПроцедуры 

&НаСервере
Процедура ЗавершитьРаботуСервер()
	
	Если Не РольДоступна("тсАдминистрирование") ИЛИ Не РольДоступна("ПолныеПрава") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У Вас нет прав для совершения этой операции!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект КАК Объект
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|ГДЕ
		|	ОбъектыВРаботеОстатки.Объект.Ссылка ЕСТЬ NULL";
	
	Рез = Запрос.Выполнить(); 
	
	Если Рез.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В базе нет битых ссылок, операция прервана!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДокЗавершение = Документы.ЗавершениеРаботыОрганизации.СоздатьДокумент();
	ДокЗавершение.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокЗавершение.Дата = ТекущаяДатаСеанса();
	ДокЗавершение.Комментарий = "Вывод битых ссылок ПРОГРАММНО";
	ДокЗавершение.Организация = ПараметрыСеанса.ТекущийПользователь.Организация;
	ДокЗавершение.ОбнулитьЗадолженность = Истина;
	ДокЗавершение.ОбнулитьКатегории = Истина;
	
	ДокЗавершение.Объекты.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ДокЗавершение.Записать(РежимЗаписиДокумента.Проведение);              
	
КонецПроцедуры
